In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

Set up is complete, next is the engine

In [4]:
engine = create_engine(connection_string)

The next part is the beginning of the SQL queries

In [90]:
query = '''
SELECT *
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'scooters'
ORDER BY ORDINAL_POSITION
'''

result = engine.execute(query)

In [91]:
lat = pd.read_sql(query, con = engine)
lat.head()

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,scooters,public,scooters,pubdatetime,1,None,YES,timestamp without time zone,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,scooters,public,scooters,latitude,2,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,scooters,public,scooters,longitude,3,None,YES,numeric,None,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,scooters,public,scooters,sumdid,4,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,scooters,public,scooters,sumdtype,5,None,YES,text,None,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [9]:
query = '''
SELECT *
FROM scooters
LIMIT 5;
'''

result = engine.execute(query)

In [10]:
lat = pd.read_sql(query, con = engine)
lat.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [24]:
query2 = '''
SELECT *
FROM trips
LIMIT 20;
'''

result = engine.execute(query2)

In [25]:
lat2 = pd.read_sql(query2, con = engine)
lat2.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [14]:
# What is the date range in each of the date columns.   

query4 = '''
SELECT MAX(pubdatetime), MIN(pubdatetime)
FROM scooters;
'''

result = engine.execute(query4)

In [15]:
lat = pd.read_sql(query4, con = engine)
lat.head()

                  max                     min
0 2019-07-31 23:59:57 2019-05-01 00:01:41.247

In [17]:
query5 = '''
SELECT MAX(pubtimestamp), MIN(pubtimestamp)
FROM trips;
'''

result = engine.execute(query5)

In [18]:
lat = pd.read_sql(query5, con = engine)
lat.head()

                  max                     min
0 2019-08-01 07:04:00 2019-05-01 00:00:55.423

The start and end times do not match between the two tables.  They are off.

In [26]:
query6 = '''
SELECT MAX(pubdatetime), MIN(pubdatetime)
FROM scooters
WHERE sumdid = 'Powered9EAJL';
'''

In [27]:
lat = pd.read_sql(query6, con = engine)
lat.head()

                  max                     min
0 2019-05-04 17:05:05 2019-05-01 00:06:41.537

In [30]:
query7 = '''
SELECT MAX(pubtimestamp), MIN(pubtimestamp)
FROM trips
WHERE sumdid = 'Powered9EAJL';
'''
result = engine.execute(query7)

In [31]:
lat = pd.read_sql(query7, con = engine)
lat.head()

                      max                     min
0 2019-05-07 18:03:49.303 2019-05-01 00:00:55.423

The first and last trip for Powered9EAJL do not match between tables.

In [55]:
query8 = '''
SELECT pubdatetime,	latitude, longitude, sumdid, sumdtype, chargelevel, sumdgroup, costpermin, companyname
FROM scooters
WHERE chargelevel IS NULL;
'''

result = engine.execute(query8)

In [56]:
lat = pd.read_sql(query8, con = engine)
lat.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-22 12:49:15.670,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
1,2019-05-22 12:54:15.973,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
2,2019-05-22 12:59:15.967,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
3,2019-05-22 13:04:16.220,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin
4,2019-05-22 13:09:16.340,36.147647,-86.740524,Powered4233824,Powered,None,Scooter,0.23,Spin

In [87]:
query9 = '''
SELECT pubtimestamp, companyname, triprecordnum, sumdid, tripduration, tripdistance, 
    startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt
FROM trips
WHERE create_dt IS NULL;
'''

result = engine.execute(query9)

In [88]:
lat = pd.read_sql(query9, con = engine)
lat.head()

Empty DataFrame
Columns: [pubtimestamp, companyname, triprecordnum, sumdid, tripduration, tripdistance, startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt]
Index: []

There are nulls in the chargelevel, but that is about it.

What date range is represented in each of the date columns? Investigate any values that seem odd.

It appears that in all are supposed to be in 24 hour format.

What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [92]:
query10 = '''
SELECT DISTINCT sumdgroup
FROM scooters
'''
result = engine.execute(query10)

In [94]:
lat = pd.read_sql(query10, con = engine)
lat.head()

  sumdgroup
0   bicycle
1   scooter
2   Scooter

There are also bicycles included in this is for scooters.

What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [98]:
query11 = '''
SELECT MAX(longitude), MIN(longitude)
FROM scooters
'''
result = engine.execute(query11)

In [99]:
lat = pd.read_sql(query11, con = engine)
lat.head()

   max        min
0  0.0 -97.443879

In [101]:
query12 = '''
SELECT MAX(latitude), MIN(latitude)
FROM scooters
'''
result = engine.execute(query12)

In [102]:
lat = pd.read_sql(query12, con = engine)
lat.head()

            max  min
0  3.609874e+06  0.0

It looks like there could be a bike near the equator or at the Prime Meridian.